RT-Thread/rt-thread/bsp/nxp/lpc/lpc55sxx/Libraries/LPC55S36/LPC55S36/drivers/fsl_irtc.h
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#ifndef _FSL_IRTC_H_
#define _FSL_IRTC_H_

#include "fsl_common.h"

/*!
 * @addtogroup irtc
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
#define FSL_IRTC_DRIVER_VERSION (MAKE_VERSION(2, 1, 0)) /*!< Version. */
/*@}*/

/*! @brief IRTC filter clock source options. */
typedef enum _irtc_filter_clock_source
{
    kIRTC_32K = 0x0U, /*!< Use 32 kHz clock source for the tamper filter.*/
    kIRTC_512 = 0x1U, /*!< Use 512 Hz clock source for the tamper filter.*/
    kIRTC_128 = 0x2U, /*!< Use 128 Hz clock source for the tamper filter.*/
    kIRTC_64  = 0x3U, /*!< Use 64 Hz clock source for the tamper filter.*/
    kIRTC_16  = 0x4U, /*!< Use 16 Hz clock source for the tamper filter.*/
    kIRTC_8   = 0x5U, /*!< Use 8 Hz clock source for the tamper filter.*/
    kIRTC_4   = 0x6U, /*!< Use 4 Hz clock source for the tamper filter.*/
    kIRTC_2   = 0x7U  /*!< Use 2 Hz clock source for the tamper filter.*/
} irtc_filter_clock_source_t;

/*! @brief IRTC Tamper pins. */
typedef enum _irtc_tamper_pins
{
    kIRTC_Tamper_0 = 0U, /*!< External Tamper 0 */
    kIRTC_Tamper_1,      /*!< External Tamper 1 */
    kIRTC_Tamper_2,      /*!< External Tamper 2 */
    kIRTC_Tamper_3       /*!< Internal tamper, does not have filter configuration */
} irtc_tamper_pins_t;

/*! @brief List of IRTC interrupts */
typedef enum _irtc_interrupt_enable
{
    kIRTC_TamperInterruptEnable = RTC_IER_TAMPER_IE_MASK, /*!< Tamper Interrupt Enable */
    kIRTC_AlarmInterruptEnable  = RTC_IER_ALM_IE_MASK,    /*!< Alarm Interrupt Enable */
    kIRTC_DayInterruptEnable    = RTC_IER_DAY_IE_MASK,    /*!< Days Interrupt Enable */
    kIRTC_HourInterruptEnable   = RTC_IER_HOUR_IE_MASK,   /*!< Hours Interrupt Enable */
    kIRTC_MinInterruptEnable    = RTC_IER_MIN_IE_MASK,    /*!< Minutes Interrupt Enable */
    kIRTC_1hzInterruptEnable    = RTC_IER_IE_1HZ_MASK,    /*!< 1 Hz interval Interrupt Enable */
    kIRTC_2hzInterruptEnable    = RTC_IER_IE_2HZ_MASK,    /*!< 2 Hz interval Interrupt Enable */
    kIRTC_4hzInterruptEnable    = RTC_IER_IE_4HZ_MASK,    /*!< 4 Hz interval Interrupt Enable */
    kIRTC_8hzInterruptEnable    = RTC_IER_IE_8HZ_MASK,    /*!< 8 Hz interval Interrupt Enable */
    kIRTC_16hzInterruptEnable   = RTC_IER_IE_16HZ_MASK,   /*!< 16 Hz interval Interrupt Enable */
    kIRTC_32hzInterruptEnable   = RTC_IER_IE_32HZ_MASK,   /*!< 32 Hz interval Interrupt Enable */
    kIRTC_64hzInterruptEnable   = RTC_IER_IE_64HZ_MASK,   /*!< 64 Hz interval Interrupt Enable */
    kIRTC_128hzInterruptEnable  = RTC_IER_IE_128HZ_MASK,  /*!< 128 Hz interval Interrupt Enable */
    kIRTC_256hzInterruptEnable  = RTC_IER_IE_256HZ_MASK,  /*!< 256 Hz interval Interrupt Enable */
    kIRTC_512hzInterruptEnable  = RTC_IER_IE_512HZ_MASK,  /*!< 512 Hz interval Interrupt Enable */
#if defined(FSL_FEATURE_RTC_HAS_SUBSYSTEM) && FSL_FEATURE_RTC_HAS_SUBSYSTEM
    kIRTC_WakeTimerInterruptEnable = (RTC_WAKE_TIMER_CTRL_INTR_EN_MASK << 16U), /*!< Wake timer Interrupt Enable */
#endif
#if defined(FSL_FEATURE_RTC_HAS_TAMPER_QUEUE) && FSL_FEATURE_RTC_HAS_TAMPER_QUEUE
    kIRTC_TamperQueueFullInterruptEnable =
        (RTC_TAMPER_QSCR_Q_FULL_INT_EN_MASK << 24U), /*!< Tamper queue full Interrupt Enable */
#endif
} irtc_interrupt_enable_t;

/*! @brief List of IRTC flags */
typedef enum _irtc_status_flags
{
    kIRTC_TamperFlag     = RTC_ISR_TAMPER_IS_MASK,                 /*!< Tamper Status flag*/
    kIRTC_AlarmFlag      = RTC_ISR_ALM_IS_MASK,                    /*!< Alarm Status flag */
    kIRTC_DayFlag        = RTC_ISR_DAY_IS_MASK,                    /*!< Days Status flag */
    kIRTC_HourFlag       = RTC_ISR_HOUR_IS_MASK,                   /*!< Hour Status flag */
    kIRTC_MinFlag        = RTC_ISR_MIN_IS_MASK,                    /*!< Minutes Status flag */
    kIRTC_1hzFlag        = RTC_ISR_IS_1HZ_MASK,                    /*!< 1 Hz interval status flag */
    kIRTC_2hzFlag        = RTC_ISR_IS_2HZ_MASK,                    /*!< 2 Hz interval status flag*/
    kIRTC_4hzFlag        = RTC_ISR_IS_4HZ_MASK,                    /*!< 4 Hz interval status flag*/
    kIRTC_8hzFlag        = RTC_ISR_IS_8HZ_MASK,                    /*!< 8 Hz interval status flag*/
    kIRTC_16hzFlag       = RTC_ISR_IS_16HZ_MASK,                   /*!< 16 Hz interval status flag*/
    kIRTC_32hzFlag       = RTC_ISR_IS_32HZ_MASK,                   /*!< 32 Hz interval status flag*/
    kIRTC_64hzFlag       = RTC_ISR_IS_64HZ_MASK,                   /*!< 64 Hz interval status flag*/
    kIRTC_128hzFlag      = RTC_ISR_IS_128HZ_MASK,                  /*!< 128 Hz interval status flag*/
    kIRTC_256hzFlag      = RTC_ISR_IS_256HZ_MASK,                  /*!< 256 Hz interval status flag*/
    kIRTC_512hzFlag      = RTC_ISR_IS_512HZ_MASK,                  /*!< 512 Hz interval status flag*/
    kIRTC_InvalidFlag    = (RTC_STATUS_INVAL_BIT_MASK << 16U),     /*!< Indicates if time/date counters are invalid */
    kIRTC_WriteProtFlag  = (RTC_STATUS_WRITE_PROT_EN_MASK << 16U), /*!< Write protect enable status flag */
    kIRTC_CpuLowVoltFlag = (RTC_STATUS_CPU_LOW_VOLT_MASK << 16U),  /*!< CPU low voltage warning flag */
    kIRTC_ResetSrcFlag   = (RTC_STATUS_RST_SRC_MASK << 16U),       /*!< Reset source flag */
    kIRTC_CmpIntFlag     = (RTC_STATUS_CMP_INT_MASK << 16U),       /*!< Compensation interval status flag */
    kIRTC_BusErrFlag     = (RTC_STATUS_BUS_ERR_MASK << 16U),       /*!< Bus error flag */
    kIRTC_CmpDoneFlag    = (RTC_STATUS_CMP_DONE_MASK << 16U),      /*!< Compensation done flag */
#if defined(FSL_FEATURE_RTC_HAS_SUBSYSTEM) && FSL_FEATURE_RTC_HAS_SUBSYSTEM
    kIRTC_WakeTimerFlag = (RTC_WAKE_TIMER_CTRL_WAKE_FLAG_MASK << 28U) /*!< Wake timer status flag */
#endif
} irtc_status_flags_t;

/*! @brief IRTC alarm match options */
typedef enum _irtc_alarm_match
{
    kRTC_MatchSecMinHr          = 0U, /*!< Only match second, minute and hour */
    kRTC_MatchSecMinHrDay       = 1U, /*!< Only match second, minute, hour and day */
    kRTC_MatchSecMinHrDayMnth   = 2U, /*!< Only match second, minute, hour, day and month */
    kRTC_MatchSecMinHrDayMnthYr = 3U  /*!< Only match second, minute, hour, day, month and year */
} irtc_alarm_match_t;

/*! @brief List of RTC Oscillator capacitor load settings */
typedef enum _irtc_osc_cap_load
{
    kIRTC_Capacitor2p  = (1U << 1U), /*!< 2pF capacitor load */
    kIRTC_Capacitor4p  = (1U << 2U), /*!< 4pF capacitor load */
    kIRTC_Capacitor8p  = (1U << 3U), /*!< 8pF capacitor load */
    kIRTC_Capacitor16p = (1U << 4U)  /*!< 16pF capacitor load */
} irtc_osc_cap_load_t;

