RT-Thread/rt-thread/bsp/nxp/lpc/lpc55sxx/Libraries/LPC55S36/LPC55S36/drivers/fsl_irtc.h
    return intsEnabled;
}

/*! @}*/

/*!
 * @name Status Interface
 * @{
 */

/*!
 * @brief Gets the IRTC status flags
 *
 * @param base IRTC peripheral base address
 *
 * @return The status flags. This is the logical OR of members of the
 *         enumeration ::irtc_status_flags_t
 */
static inline uint32_t IRTC_GetStatusFlags(RTC_Type *base)
{
#if defined(FSL_FEATURE_RTC_HAS_SUBSYSTEM) && FSL_FEATURE_RTC_HAS_SUBSYSTEM
    return (base->ISR | ((uint32_t)base->STATUS << 16U) | ((uint32_t)base->WAKE_TIMER_CTRL << 28U));
#else
    return (base->ISR | ((uint32_t)base->STATUS << 16U));
#endif
}

/*!
 * @brief Clears the IRTC status flags.
 *
 * @param base IRTC peripheral base address
 * @param mask The status flags to clear. This is a logical OR of members of the
 *             enumeration ::irtc_status_flags_t
 */
static inline void IRTC_ClearStatusFlags(RTC_Type *base, uint32_t mask)
{
    base->ISR    = (uint16_t)mask;
    base->STATUS = (base->STATUS & ~((uint16_t)RTC_STATUS_BUS_ERR_MASK | (uint16_t)RTC_STATUS_CMP_DONE_MASK)) |
                   ((uint16_t)(mask >> 16U));
#if defined(FSL_FEATURE_RTC_HAS_SUBSYSTEM) && FSL_FEATURE_RTC_HAS_SUBSYSTEM
    if (0U != (mask & kIRTC_WakeTimerFlag))
    {
        base->WAKE_TIMER_CTRL |= RTC_WAKE_TIMER_CTRL_WAKE_FLAG_MASK;
    }
#endif
}

/*! @}*/

/*!
 * @brief This function sets the specified capacitor configuration for the RTC oscillator.
 *
 * @param base    IRTC peripheral base address
 * @param capLoad Oscillator loads to enable. This is a logical OR of members of the
 *                enumeration ::irtc_osc_cap_load_t
 */
static inline void IRTC_SetOscCapLoad(RTC_Type *base, uint16_t capLoad)
{
    uint16_t reg = base->GP_DATA_REG;

    reg &= ~((uint16_t)kIRTC_Capacitor2p | (uint16_t)kIRTC_Capacitor4p | (uint16_t)kIRTC_Capacitor8p |
             (uint16_t)kIRTC_Capacitor16p);
    reg |= capLoad;

    base->GP_DATA_REG = reg;
}

/*!
 * @brief Locks or unlocks IRTC registers for write access.
 *
 * @note When the registers are unlocked, they remain in unlocked state for
 * 2 seconds, after which they are locked automatically. After
 * power-on-reset, the registers come out unlocked and they are locked
 * automatically 15 seconds after power on.
 *
 * @param base IRTC peripheral base address
 * @param lock true: Lock IRTC registers; false: Unlock IRTC registers.
 *
 * @return kStatus_Success: if lock or unlock operation is successful
 *         kStatus_Fail: if lock or unlock operation fails even after multiple retry attempts
 */
status_t IRTC_SetWriteProtection(RTC_Type *base, bool lock);

/*!
 * @brief Performs a software reset on the IRTC module.
 *
 * Clears contents of alarm, interrupt (status and enable except tamper interrupt enable bit)
 * registers, STATUS[CMP_DONE] and STATUS[BUS_ERR]. This has no effect on DST, calendaring, standby time
 * and tamper detect registers.
 *
 * @param base IRTC peripheral base address
 */
static inline void IRTC_Reset(RTC_Type *base)
{
    base->CTRL |= RTC_CTRL_SWR_MASK;
}

/*!
 * @brief Enable/disable 32 kHz RTC OSC clock during RTC register write
 *
 * @param base IRTC peripheral base address
 * @param enable Enable/disable 32 kHz RTC OSC clock.
 *               - true: Enables the oscillator.
 *               - false: Disables the oscillator.
 *
 */
static inline void IRTC_Enable32kClkDuringRegisterWrite(RTC_Type *base, bool enable)
{
    if (enable)
    {
        base->GP_DATA_REG &= ~RTC_GP_DATA_REG_CFG0_MASK;
    }
    else
    {
        base->GP_DATA_REG |= RTC_GP_DATA_REG_CFG0_MASK;
    }
}

/*!
 * @brief Select which clock to output from RTC.
 *
 * Select which clock to output from RTC for other modules to use inside SoC, for example,
 * RTC subsystem needs RTC to output 1HZ clock for sub-second counter.
 *
 * @param base IRTC peripheral base address
 * @param cloOut select clock to use for output,
 */
void IRTC_ConfigClockOut(RTC_Type *base, irtc_clockout_sel_t clkOut);

/*!
 * @brief Gets the IRTC Tamper status flags
 *
 * @param base IRTC peripheral base address
 *
 * @return The Tamper status value.
 */
static inline uint8_t IRTC_GetTamperStatusFlag(RTC_Type *base)
{
    return (base->TAMPER_SCR & RTC_TAMPER_SCR_TMPR_STS_MASK) >> RTC_TAMPER_SCR_TMPR_STS_SHIFT;
}

/*!
 * @brief Gets the IRTC Tamper status flags
 *
 * @param base IRTC peripheral base address
 *
 */
static inline void IRTC_ClearTamperStatusFlag(RTC_Type *base)
{
    /* Writing '1' to this field clears the tamper status.*/
    base->TAMPER_SCR |= RTC_TAMPER_SCR_TMPR_STS_MASK;
}

/*!
 * @brief Set tamper configuration over
 *
 * Note that this API is neeeded after call IRTC_SetTamperParams to configure tamper events to
 * notify IRTC module that tamper configuration process is over.
 *
 * @param base IRTC peripheral base address
 *
 */
static inline void IRTC_SetTamperConfigurationOver(RTC_Type *base)
{
    /* Set tamper configuration over.*/
    base->CTRL2 |= RTC_CTRL2_TAMP_CFG_OVER_MASK;
}

/*!
 * @name Daylight Savings Interface
 * @{
 */

/*!
 * @brief Sets the IRTC daylight savings start and stop date and time.
 *
 * It also enables the daylight saving bit in the IRTC control register
 *
 * @param base     IRTC peripheral base address
 * @param datetime Pointer to a structure where the date and time details are stored.
 */
void IRTC_SetDaylightTime(RTC_Type *base, const irtc_daylight_time_t *datetime);

/*!
 * @brief Gets the IRTC daylight savings time and stores it in the given time structure.
 *
 * @param base     IRTC peripheral base address
 * @param datetime Pointer to a structure where the date and time details are stored.
 */
void IRTC_GetDaylightTime(RTC_Type *base, irtc_daylight_time_t *datetime);

/*! @}*/

/*!
 * @name Time Compensation Interface
 * @{
 */

/*!
 * @brief Enables the coarse compensation and sets the value in the IRTC compensation register.
 *
 * @param base                 IRTC peripheral base address
 * @param compensationValue    Compensation value is a 2's complement value.
 * @param compensationInterval Compensation interval.
 */
void IRTC_SetCoarseCompensation(RTC_Type *base, uint8_t compensationValue, uint8_t compensationInterval);

/*!
 * @brief Enables the fine compensation and sets the value in the IRTC compensation register.
 *
 * @param base                 The IRTC peripheral base address
 * @param integralValue        Compensation integral value; twos complement value of the integer part
 * @param fractionValue        Compensation fraction value expressed as number of clock cycles of a
 *                             fixed 4.194304Mhz clock that have to be added.
 * @param accumulateFractional Flag indicating if we want to add to previous fractional part;
 *                             true: Add to previously accumulated fractional part,
 *                             false: Start afresh and overwrite current value
 */
void IRTC_SetFineCompensation(RTC_Type *base, uint8_t integralValue, uint8_t fractionValue, bool accumulateFractional);

/*! @}*/

/*!
 * @name Tamper Interface
 * @{
 */

/*!
 * @brief This function allows configuring the four tamper inputs.
 *
 * The function configures the filter properties for the three external tampers.
 * It also sets up active/passive and direction of the tamper bits, which are not available
 * on all platforms.
 * @note This function programs the tamper filter parameters. The user must gate the 32K clock to
 * the RTC before calling this function. It is assumed that the time and date are set after this
 * and the tamper parameters do not require to be changed again later.
 *
 * @param base         The IRTC peripheral base address
 * @param tamperNumber The IRTC tamper input to configure
 * @param tamperConfig The IRTC tamper properties
 */
void IRTC_SetTamperParams(RTC_Type *base, irtc_tamper_pins_t tamperNumber, const irtc_tamper_config_t *tamperConfig);

#if defined(FSL_FEATURE_RTC_HAS_TAMPER_QUEUE) && (FSL_FEATURE_RTC_HAS_TAMPER_QUEUE)

/*!
 * @brief This function reads the tamper timestamp and returns the associated tamper pin.
 *
 * The tamper timestamp has month, day, hour, minutes, and seconds. Ignore the year field as this
 * information is not available in the tamper queue. The user should look at the RTC_YEARMON register
 * for this because the expectation is that the queue is read at least once a year.
 * Return the tamper pin number associated with the timestamp.
 *
 * @param base             The IRTC peripheral base address
 * @param tamperTimestamp  The tamper timestamp
 *
 * @return The tamper pin number
 */
uint8_t IRTC_ReadTamperQueue(RTC_Type *base, irtc_datetime_t *tamperTimestamp);

/*!
 * @brief Gets the IRTC Tamper queue full status
 *
 * @param base IRTC peripheral base address
 *
 * @retval true Tamper queue is full.
 * @retval false Tamper queue is not full.
 */
static inline bool IRTC_GetTamperQueueFullStatus(RTC_Type *base)
{
    return ((0U != (base->TAMPER_SCR & RTC_TAMPER_QSCR_Q_FULL_MASK)) ? true : false);
}

/*!
 * @brief Clear the IRTC Tamper queue full status
 *
 * @param base IRTC peripheral base address
 *
 */
static inline void IRTC_ClearTamperQueueFullStatus(RTC_Type *base)
{
    base->TAMPER_QSCR |= RTC_TAMPER_QSCR_Q_CLEAR_MASK;
}
#endif /* FSL_FEATURE_RTC_HAS_TAMPER_QUEUE */

/*! @}*/

#if defined(FSL_FEATURE_RTC_HAS_SUBSYSTEM) && FSL_FEATURE_RTC_HAS_SUBSYSTEM
/*!
 * @name RTC subsystem Interface
 * @{
 */

/*!
 * @brief Enable the RTC wake-up timer.
 *
 * 1HZ clock out selected via call to API IRTC_ConfigClockOut in order for the subsecond
 * counter to synchronize with the RTC_SECONDS counter.
 *
 * @param base   RTC peripheral base address
 * @param enable Use/Un-use the sub-second counter.
 *               - true: Use RTC wake-up timer at the same time.
 *               - false: Un-use RTC wake-up timer, RTC only use the normal seconds timer by default.
 */
static inline void IRTC_EnableSubsecondCounter(RTC_Type *base, bool enable)
{
    if (enable)
    {
        base->SUBSECOND_CTRL |= RTC_SUBSECOND_CTRL_SUB_SECOND_CNT_EN_MASK;
    }
    else
    {
        base->SUBSECOND_CTRL &= ~RTC_SUBSECOND_CTRL_SUB_SECOND_CNT_EN_MASK;
    }
}

/*!
 * @brief Read the actual RTC sub-second COUNT value.
 *
 * @param base  RTC peripheral base address
 *
 * @return The actual RTC sub-second COUNT value.
 */
static inline uint32_t IRTC_GetSubsecondCount(RTC_Type *base)
{
    uint32_t a, b;

    /* Follow the RF document to read the RTC default seconds timer (1HZ) counter value. */
    do
    {
        a = base->SUBSECOND_CNT;
        b = base->SUBSECOND_CNT;
    } while (a != b);

    return b;
}
/*!
 * @brief Set countdown value to the RTC wake timer counter register.
 *
 * @param base        RTC peripheral base address
 * @param enable1kHzClk   Enable 1kHz clock source for the wake timer, else use the 32kHz clock.
 * @param wakeupValue The value to be loaded into the WAKE register in wake timer counter.
 */
static inline void IRTC_SetWakeupCount(RTC_Type *base, bool enable1kHzClk, uint32_t wakeupValue)
{
    /* Config whether enable the wakeup counter */
    uint32_t writeVal;
    writeVal              = base->WAKE_TIMER_CTRL;
    base->WAKE_TIMER_CTRL = RTC_WAKE_TIMER_CTRL_CLR_WAKE_TIMER_MASK;

    if (enable1kHzClk)
    {
        writeVal |= RTC_WAKE_TIMER_CTRL_OSC_DIV_ENA_MASK;
    }
    else
    {
        writeVal &= ~RTC_WAKE_TIMER_CTRL_OSC_DIV_ENA_MASK;
    }

    base->WAKE_TIMER_CTRL = writeVal;
    /* Set the start countdown value into the RTC WAKE register */
    base->WAKE_TIMER_CNT = wakeupValue;
}

/*!
 * @brief Read the actual value from the WAKE register value in RTC wake timer.
 *
 * @param base        RTC peripheral base address
 *
 * @return The actual value of the WAKE register value in wake timer counter.
 */
static inline uint32_t IRTC_GetWakeupCount(RTC_Type *base)
{
    /* Read current wake-up countdown value */
    return base->WAKE_TIMER_CNT;
}

/*! @}*/
#endif

#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* _FSL_IRTC_H_ */
